# 7. По длинам трех отрезков, введенных пользователем, определить возможность существования
# треугольника, составленного из этих отрезков. Если такой треугольник существует, то
# определить, является ли он разносторонним, равнобедренным или равносторонним.


def triangle_type(a, b, c):
    if a + b <= c or a + c <= b or b + c <= a:
        print("Треугольник не существует")
    elif a != b and a != c and b != c:
        print("Разносторонний")
    elif a == b == c:
        print("Равносторонний")
    else:
        print("Равнобедренный")


if __name__ == '__main__':
    triangle_type(
        int(input()),
        int(input()),
        int(input())
    )
